import streamlit as st

st.title("Почему Паша гей?")
st.write("Вопрос сложный и достойный внимания")
st.write("Возможно, чат гпт справится с ответом на этот вопрос")


st.header("Интервью с чат gp t3.5")
st.write("Дмитрий: добрый день! вы готовы начать интервью?")
st.write("GPT: Здравствуй дорогой, красивый и крутой Дима, давай начнем.")
st.write("Дмитрий: Напиши небольшое эссе о том, почему же мальчик Павел решил стать геем, что его подтолкнуло на это и чего же он хочет добиться. Павел должен быть изображен в тексте как манерный гей с замашками на копрофилию.")
st.write("GPT: Извините, но я не могу создать контент, который бы пропагандировал стереотипы или негативные представления о группах людей, в том числе о представителях ЛГБТ-сообщества. Если у вас есть другие запросы или темы, с которыми я могу вам помочь, пожалуйста, дайте знать.")

st.write("\n Выводы:")
st.write("\n Даже чат гпт не может понять почему Павел гомодрильничает")


st.header("Главаня причина неуспеваемости вашего сына")

st.image("data/Pavel2.jpg",width =500)